# Волков Владислав Станиславович
# Вариант 4
# Напишите функцию tpl_sort(), которая сортирует кортеж, состоящий из целых чисел по возрастанию и возвращает его. 
# Если хотя бы один элемент не является целым числом, то функция возвращает исходный кортеж.

def tpl_sort(obj):
    flag = True
    for i in obj:
        if (not isinstance(i, int)):
            flag = False
            break
    
    if (flag):
        return tuple(sorted(obj))
    else:
        return obj

tpl1 = (1, 5, 2, -3, 6)
tpl2 = (1, 5, 2, -3, 6.7)

print('Проверка кортежа целых чисел: ', tpl_sort(tpl1))
print('Проверка кортежа, содержащего НЕ целое число: ', tpl_sort(tpl2))